// Напишите программу, которая на вход
// принмает число и выдает его квадрат (число,
// умноженное на само себя)





Console.Write("Введите целое число");
int number = Convert.ToInt32(Console.ReadLine());
int square = number * number;
Console.WriteLine($"Квадрат чисел {number} = {square}");
